

const FACTS = [
    "Зіниці у тигрів не вертикальні, як у домашніх кішок, а круглі. Це обумовлено тим, що тигр веде не нічний, а сутінковий спосіб життя. В темряві тигри бачать приблизно вшестеро краще, ніж люди",
    "Для підтримання життєдіяльності тигру потрібно приблизно вдвічі більше їжі, ніж леву. За рік дорослий тигр з\'їдає до трьох тонн м\'яса",
    "В індійських заповідниках працівники носять на потилиці маски, що імітують людські обличчя. Вважається, що це допомагає вберегтися від нападу тигра, оскільки той нападає тільки із засідки та зі спини. Будучи поміченим, тигр, швидше за все, піде шукати іншу жертву",
    "Тигри не вміють муркотіти, але кожна тварина має унікальний голос. Також вони вміють імітувати голоси інших тварин",
    "Трохи незвичайний у тигрів спосіб пити воду. Вони не загрібають її “ковшем”, а підкидають язиком, потім закривають пащу",
    "Тигри можуть спаровуватися і давати потомство з іншими дикими котячими, за винятком левів",
    "Тигри — справжні смугастики. Навіть якщо тигра поголити — на шкірі в нього все одно лишаться темні смуги. Після цього шерсть відросте з точно таким же візерунком, як і був до цього. Двох тигрів з однаковими смужками зустріти неможливо. Смугастий малюнок тигра складає понад 100 смужок",
    "Удачею для тигра закінчується в середньому лише один напад на здобич з десяти",
    "Тигри часто діляться їжею з іншими. А ще, на відміну від левів, можуть зачекати, доки не почне їсти тигриця та дитинчата",
    "За допомогою гарчання тигри спілкуються між собою на великій відстані. Розлючені тигри ніколи не гарчать, вони шиплять",
    "Згідно з дослідженнями вчених, пам’ять тигрів в кілька сотень разів краща, ніж у собак",
    "За один рік тигр в середньому з’їдає 50 копитних, але що найцікавіше, він ніколи не вбиває більше, ніж може з’їсти, на відміну від вовків, які душать стільки, скільки встигнуть, тим самим часто підриваючи поголів’я копитних"
]

const MONTHS = ['січня', 'лютого', 'березня', 'квітня', 'травня', 'червня', 'липня', 'серпня', 'вересня', 'жовтня', 'листопада', 'грудня']

const params = new URLSearchParams(window.location.search);
const aim = params.get('aim');
if (aim === 'heading') {
    document.querySelector('.wrapper').innerHTML = `<div class="text-wrapper"><div>Веселих свят! Нехай цей рік принесе Вам безліч приємних моментів та цікавих відкриттів! Скануйте QR-код кожного місяця та отримуйте цікавий факт про символ року.</div><div class="authors">Сергій та Оля</div></div>`
}
if (!aim) {
    const monthNumber = new Date().getMonth() % 12;
    document.querySelector('.wrapper').innerHTML = `<div class="text-wrapper"><div class="heading">Факт ${MONTHS[monthNumber]}</div><div class="fact">${FACTS[monthNumber]}</div></div>`
}
